change diagrams to mermaid for nicer look :)
